CompSci/monadsgonads.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Monads and Gonads Notes</title>
<!-- 2016-01-24 Sun 07:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Monads and Gonads Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Notes</a>
<ul>
<li><a href="#sec-2-1">Programming with functions</a></li>
<li><a href="#sec-2-2">Pure Functional Programming</a></li>
<li><a href="#sec-2-3">The trick..</a></li>
</ul>
</li>
<li><a href="#sec-3">Side note - Concurrency</a></li>
<li><a href="#sec-4">Side note - Actor Model</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
These are some notes from a talk about Monads by Douglas
Crockford. The video can be found on youtube <a href="http://www.youtube.com/watch?v=b0EF0VTs9Dc&feature=youtu.be">here</a>. IT is about 50
minutes long.
</p>

<p>
I've never completely understood monads and it is said that as soon
as you understand them you lose the ability to explain them. Let's
see if Doug can clear things up&#x2026;
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Notes</h2>
<div class="outline-text-2" id="text-2">
<p>
Monads are a pattern that comes with the curse stated above.
</p>

<p>
Starting with functional programming there are two senses:
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Programming with functions</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Started with FORTRAN II in 1958.
</p>

<p>
Only becomes interesting when we have first class functions, higher
order functions and lexical closure. Allowing passing of functions
as arguments, setting as variables etc.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Pure Functional Programming</h3>
<div class="outline-text-3" id="text-2-2">
<p>
No mutation in functions, a more mathematical approach. Programs
are easier to reason about. A function is a map from a set of
values to a another set of values with no side effects.
</p>

<p>
Memoization and Caching are two examples of a different approach.
</p>

<p>
Remove assignments, loops and freeze all arrays and object literals.
</p>

<p>
This makes for a completely non practical language as in the real
world everything changes. Immutability makes it hard to interact
with the real world - no side effects such as IO for example.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">The trick..</h3>
<div class="outline-text-3" id="text-2-3">
<p>
A function can take a function as an argument making each
function being different.
</p>

<p>
Haskell has the IO Monad. A solution to a problem you should never
have. 
</p>

<p>
Check out Category Theory as the basis of monads. And learning
Haskell helps.
</p>

<p>
It's easier to reason about Monads without the type system that
Haskell has.
</p>

<p>
The following examples in JavaScript all return a monad:
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span class="linenr">1: </span><span style="color: #859900;">function</span> <span style="color: #268bd2;">unit</span>(<span style="color: #268bd2;">value</span>)
<span class="linenr">2: </span><span style="color: #859900;">function</span> <span style="color: #268bd2;">bind</span>(<span style="color: #268bd2;">monad</span>, <span style="color: #859900;">function</span>(<span style="color: #268bd2;">value</span>))
</pre>
</div>

<p>
Axioms:
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span class="linenr">3: </span>bind(unit(value), f) ==== f(value)
<span class="linenr">4: </span>bind(monad, unit) ==== monad
<span class="linenr">5: </span>bind(bind(monad, f), g) ====
<span class="linenr">6: </span>    bind(monad, <span style="color: #859900;">function</span> (<span style="color: #268bd2;">value</span>) {
<span class="linenr">7: </span>        <span style="color: #859900;">return</span> bind(f(value), g);
<span class="linenr">8: </span>    })
</pre>
</div>

<p>
This can have an OO transform:
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span class="linenr"> 9: </span>bind(monad, func)
<span class="linenr">10: </span>
<span class="linenr">11: </span>monad.bind(func)
</pre>
</div>

<p>
Monads are a pattern that can be implemented as a macro in lisp, or
as with functions in JavaScript:
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span class="linenr">12: </span><span style="color: #859900;">function</span> <span style="color: #268bd2;">MONAD</span>() {
<span class="linenr">13: </span>    <span style="color: #859900;">return</span> <span style="color: #859900;">function</span> unit(<span style="color: #268bd2;">value</span>){
<span class="linenr">14: </span>        <span style="color: #859900;">var</span> <span style="color: #268bd2;">monad</span> = Object.create(<span style="color: #2aa198;">null</span>);
<span class="linenr">15: </span>        monad.bind = <span style="color: #859900;">function</span>(<span style="color: #268bd2;">func</span>) {
<span class="linenr">16: </span>            <span style="color: #859900;">return</span> func(value);
<span class="linenr">17: </span>        }
<span class="linenr">18: </span>        <span style="color: #859900;">return</span> monad;
<span class="linenr">19: </span>    }
<span class="linenr">20: </span>}
</pre>
</div>

<p>
He also suggest an alternative context color that is based on
nested levels.
</p>

<p>
An example of an identity monad:
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span class="linenr">21: </span><span style="color: #859900;">var</span> <span style="color: #268bd2;">identity</span> = MONAD();
<span class="linenr">22: </span><span style="color: #859900;">var</span> <span style="color: #268bd2;">monad</span> = identity(<span style="color: #2aa198;">"Hello world."</span>);
<span class="linenr">23: </span>monad.bind(alert);
</pre>
</div>

<p>
We can now call:
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span class="linenr">24: </span>monad.bind(f).bind(g)
</pre>
</div>

<p>
This is similar to the ajax monad. And is similar also to the
QString monad used in arg() call.
</p>

<p>
We now want to add methods to the monad:
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span class="linenr">25: </span><span style="color: #859900;">function</span> <span style="color: #268bd2;">MONAD</span>() {
<span class="linenr">26: </span>    <span style="color: #859900;">var</span> <span style="color: #268bd2;">prototype</span> = Object.create(<span style="color: #2aa198;">null</span>);
<span class="linenr">27: </span>    <span style="color: #859900;">function</span> <span style="color: #268bd2;">unit</span>(<span style="color: #268bd2;">value</span>) {
<span class="linenr">28: </span>        <span style="color: #859900;">var</span> <span style="color: #268bd2;">monad</span> = Object.create(prototype);
<span class="linenr">29: </span>        monad.bind = <span style="color: #859900;">function</span> (<span style="color: #268bd2;">func</span>, <span style="color: #268bd2;">args</span>) {
<span class="linenr">30: </span>            <span style="color: #859900;">return</span> func(value, ...args);
<span class="linenr">31: </span>        }
<span class="linenr">32: </span>        <span style="color: #859900;">return</span> monad;
<span class="linenr">33: </span>    }
<span class="linenr">34: </span>
<span class="linenr">35: </span>    unit.lift = <span style="color: #859900;">function</span> (<span style="color: #268bd2;">name</span>, <span style="color: #268bd2;">func</span>) {
<span class="linenr">36: </span>        prototype[name] = <span style="color: #859900;">function</span>(...args) {
<span class="linenr">37: </span>            <span style="color: #859900;">return</span> unit(<span style="color: #2aa198;">this</span>.bind(func, args));
<span class="linenr">38: </span>        }
<span class="linenr">39: </span>        <span style="color: #859900;">return</span> unit;
<span class="linenr">40: </span>    };
<span class="linenr">41: </span>
<span class="linenr">42: </span>    <span style="color: #859900;">return</span> unit;
<span class="linenr">43: </span>}
</pre>
</div>

<p>
Lift will take an ordinary function add it to the prototype and
make it monad aware. An example of it's use:
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span class="linenr">44: </span><span style="color: #859900;">var</span> <span style="color: #268bd2;">ajax</span> = MONAD().lift(<span style="color: #2aa198;">'alert'</span>, alert);
<span class="linenr">45: </span><span style="color: #859900;">var</span> <span style="color: #268bd2;">monad</span> = ajax(<span style="color: #2aa198;">"Hello world."</span>);
<span class="linenr">46: </span>
<span class="linenr">47: </span>monad.alert();
</pre>
</div>

<p>
A maybe monad for handling null pointer exceptions:
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span class="linenr">48: </span><span style="color: #859900;">function</span> <span style="color: #268bd2;">MONAD</span>(<span style="color: #268bd2;">modifier</span>) {
<span class="linenr">49: </span>    <span style="color: #859900;">var</span> <span style="color: #268bd2;">prototype</span> = Object.create(<span style="color: #2aa198;">null</span>);
<span class="linenr">50: </span>    <span style="color: #859900;">function</span> <span style="color: #268bd2;">unit</span>(<span style="color: #268bd2;">value</span>) {
<span class="linenr">51: </span>        <span style="color: #859900;">var</span> <span style="color: #268bd2;">monad</span> = Object.create(prototype);
<span class="linenr">52: </span>        monad.bind = <span style="color: #859900;">function</span> (<span style="color: #268bd2;">func</span>, <span style="color: #268bd2;">args</span>) {
<span class="linenr">53: </span>            <span style="color: #859900;">return</span> func(value, ...args);
<span class="linenr">54: </span>        };
<span class="linenr">55: </span>        <span style="color: #859900;">if</span>(<span style="color: #859900;">typeof</span> modifier === <span style="color: #2aa198;">'function'</span>) {
<span class="linenr">56: </span>            modifier(monad, value);
<span class="linenr">57: </span>        }
<span class="linenr">58: </span>        <span style="color: #859900;">return</span> monadl
<span class="linenr">59: </span>    }
<span class="linenr">60: </span>    <span style="color: #859900;">return</span> unit;
<span class="linenr">61: </span>}
<span class="linenr">62: </span>
<span class="linenr">63: </span><span style="color: #859900;">var</span> <span style="color: #268bd2;">maybe</span> = MONAD(<span style="color: #859900;">function</span> (<span style="color: #268bd2;">monad</span>, <span style="color: #268bd2;">value</span>) {
<span class="linenr">64: </span>    <span style="color: #859900;">if</span>(value === <span style="color: #2aa198;">null</span> || value === <span style="color: #2aa198;">undefined</span>) {
<span class="linenr">65: </span>        monad.is_null = <span style="color: #2aa198;">true</span>;
<span class="linenr">66: </span>        monad.bind = <span style="color: #859900;">function</span>() {
<span class="linenr">67: </span>            <span style="color: #859900;">return</span> monad;
<span class="linenr">68: </span>        }
<span class="linenr">69: </span>    }
<span class="linenr">70: </span>});
<span class="linenr">71: </span>
<span class="linenr">72: </span><span style="color: #859900;">var</span> <span style="color: #268bd2;">monad</span> = maybe(<span style="color: #2aa198;">null</span>);
<span class="linenr">73: </span>monad.bind(alert);
</pre>
</div>

<p>
Here we are changing the bind method to do nothing except return
the monad. And we don't have to worry about null pointer
exceptions.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Side note - Concurrency</h2>
<div class="outline-text-2" id="text-3">
<p>
Threading is bad with mutation. We then use mutexes which come with
their own set of problems.
</p>

<p>
With purely functional programming we never have this problem but
have no mutation.
</p>

<p>
Turn based processing - Never wait, never block, finish
fast. Asynchronicity can be hard to manage. Used by node.js.
</p>

<p>
Nested event handlers are generally bad and promises are a much
better solution.
</p>

<p>
Composition of promises are monads.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Side note - Actor Model</h2>
<div class="outline-text-2" id="text-4">
<p>
Forms the basis of scheme and solves a lot of our programming
problems.
</p>

<p>
Futures and Promises as well as Monads generally come out of the
Actor Model.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-01-24 Sun 07:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
